app/Controllers/Home.php

SELECT *
FROM `cute_url`
WHERE `user_id` = '1'
ORDER BY `dtc` DESC
---
    public function admin()
    {
        if(array_key_exists('user_session', session()->get())){
            // $data = array();
            // $data['user'] = session()->get('user_session');
            $qturl_m = new \App\Models\CuteUrl();
            $user = session()->get('user_session');

            $data['user'] = $user;
            $data['urls'] = $qturl_m
                ->where('user_id', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();